app/controllers/weathers_controller.rb

SELECT "weathers".* FROM "weathers"
---
  def index
    @weathers = Weather.all

SELECT  "weathers".* FROM "weathers" WHERE "weathers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @weather = Weather.find(params[:id])

INSERT INTO "weathers" ("city", "state", "conditions", "feel", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @weather = Weather.new(weather_params)
    @weather.user = current_user
    @weather.date = Date.today
    @weather.from_api
    if @weather.save

SELECT  "weathers".* FROM "weathers" WHERE "weathers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @weather = Weather.find(params[:id])

SELECT  "weathers".* FROM "weathers" WHERE "weathers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "weathers" SET "city" = $1, "updated_at" = $2 WHERE "weathers"."id" = $3  [["city", "Boston"], ["updated_at", "2014-12-30 17:43:12.525574"], ["id", 1]]
---
  def update
    @weather = Weather.find(params[:id])
    @weather.user = current_user
    if @weather.update(weather_params)